# CLI tools
brew "zsh-syntax-highlighting"
brew "pure"
brew "git-lfs"
brew "gpg"

# Cask apps
cask "bettertouchtool"     # Input customization & window management
cask "boop"                # Developer scratchpad
cask "chatgpt"             # OpenAI desktop app
cask "cursor"              # AI code editor
cask "discord"             # Chat
cask "figma"               # Design tool
cask "flycut"              # Clipboard manager
cask "github"              # GitHub Desktop
cask "google-chrome"       # Browser
cask "gpg-suite"           # GPG key management
cask "kitlangton-hex"      # Color picker & design tool (daily driver)
cask "macdown"             # Markdown editor
cask "notion"              # Notes & docs
cask "proxyman"            # HTTP debugging proxy
cask "raycast"             # Spotlight replacement
cask "sf-symbols"          # Apple icon browser
cask "slack"               # Team chat
cask "spotify"             # Music
cask "xcodes"              # Xcode version manager
